<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of ImageOptim and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.moccu.imageoptim.munki</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_CATEGORY</key>
            <string>Tools</string>
            <key>NAME</key>
            <string>ImageOptim</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Tools/Optimierung/%NAME%</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>ImageOptim.app</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>offline</string>
                </array>
                <key>description</key>
                <string>ImageOptim is a free app that makes images take up less disk space and load faster, without sacrificing quality. It optimizes compression parameters, removes junk metadata and unnecessary color profiles.</string>
                <key>display_name</key>
                <string>ImageOptim</string>
                <key>developer</key>
                <string>ImageAlpha</string>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.0</string>
        <key>ParentRecipe</key>
        <string>com.moccu.imageoptim.pkg</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleVersion</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
