<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest &apos;Slack&apos; and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.moccu.slack.munki</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>slack</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Tools/Kommunikation/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>offline</string>
			</array>
			<key>description</key>
			<string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
			<key>display_name</key>
			<string>Slack</string>
			<key>category</key>
			<string>Communication</string>
			<key>developer</key>
			<string>Slack</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
      <string>#!/bin/bash
chown -R $(ls -1 /Users/ | grep -wv "administrator" | grep -wv "Shared" | grep -wv "admin" | grep -wv ".localized"):wheel /Applications/Slack.app
			</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.moccu.slack.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
