<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.moccu.OpenJDK.munki</string>
    <key>Description</key>
    <string>Downloads the current release version of OpenJDK, builds a package and imports it to Munki.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>openjdk</string>
        <key>SOFTWARETITLE</key>
        <string>Java</string>
        <key>SOFTWARETYPE</key>
        <string>JDK</string>
        <key>VENDOR</key>
        <string>OpenJDK</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Tools/Plugins/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>offline</string>
            </array>
            <key>category</key>
            <string>%SOFTWARETYPE%</string>
            <key>description</key>
            <string>OpenJDK is a free and open-source implementation of the Java Platform, Standard Edition.</string>
            <key>developer</key>
            <string>%VENDOR%</string>
            <key>display_name</key>
            <string>OpenJDK</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.moccu.OpenJDK.pkg</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
